app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);
        $settingModel = new SettingModel();
        $this->settingData = $settingModel->first();
---
SELECT *
FROM `settings`
 LIMIT 1