app/Models/Ion_auth_model.php

UPDATE `users` SET `password` = '$2y$10$FOEYD3evVOM1eZGZJG1Wh.d1xjeb3z47LZP09XUnckL.LQavtx7UO', `last_login` = '2025-05-09 12:42:51'
WHERE `users`.`id` IN ('615')
UPDATE `users` SET `last_login` = '2025-05-09 12:42:51'
WHERE `users`.`id` IN ('615')
---
    if ($valid) {
        // Optional: migrate legacy hash to bcrypt
        if (password_needs_rehash($storedHash, PASSWORD_BCRYPT)) {
            $this->update($user['id'], ['password' => password_hash($password, PASSWORD_BCRYPT)]);
            log_message('debug', 'Login: Password rehashed to bcrypt');
        }

        $this->update($user['id'], ['last_login' => date('Y-m-d H:i:s')]);